'use strict';

//1 Якщо змінна a дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Неправильно'.

const a = 0;

if (a === 0) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

//2 Якщо змінна a більша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.

const a = 1;

if (a > 0) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}

//3 Якщо змінна a менша за нуль, то виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = -1;

if (a < 0) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}
//4 Якщо змінна a більша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.
const a = 0;

if (a >= 0) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

//5 Якщо змінна a менша або дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Неправильно'.

const a = 1;

if (a <= 0) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

//6 Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.

const a = 1;

if (a !== 0) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}
//7 Якщо змінна a дорівнює 'test', виведіть 'Вірно', інакше виведіть 'Неправильно'.

const a = 'test';

if (a === 'test') {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

//8 Якщо змінна a дорівнює '1' і за значенням і типом, то виведіть 'Вірно', інакше виведіть 'Невірно'.

const a = '1';

if (a === '1') {
    console.log('Вірно');
} else {
    console.log('Невірно');
}

//9 Якщо змінна a більша за нуль і менше 5-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = 1;

if (a > 0 && a < 5) {
    console.log('Вірно');
} else {
    console.log('Невірно');
}
//10 Якщо змінна a дорівнює нулю або дорівнює двом, додайте до неї 7, інакше поділіть її на 10.
//Виведіть нове значення змінної на екран.

const a = 2;

if (a === 0 || a === 2) {
    a = 7;
} else {
    a /= 10;
}

console.log('Нове значення змінної a:', a);

//11 Якщо змінна a дорівнює або менше 1, а змінна b більша або дорівнює 3, то виведіть суму цих змінних, інакше виведіть їх різницю (результат віднімання).

const a = 0; //
const b = 7; //

let result;

if (a <= 1 && b >= 3) {
    result = a + b;
} else {
    result = a - b;
}

console.log('Результат:', result);

//12 Якщо змінна a більше 2-х і менше 11-ти, або змінна b більша або дорівнює 6-ти і менше 14-ти, то виведіть 'Вірно', інакше виведіть 'Невірно'.
const a = 7;
const b = 9;

const result = ((a > 2 && a < 11) || (b >= 6 && b <= 14)) ? 'Вірно' : 'Невірно';
console.log(result);

//13 Змінна num може приймати 4 значення: 1, 2, 3 або 4. Якщо вона має значення 1, то в змінну result запишемо зима, якщо має значення 2 - весна і так далі. Розв'яжіть завдання через switch-case.

const num = 7;

let result;

switch (num) {
    case 1:
        result = 'зима';
        break;
    case 2:
        result = 'весна';
        break;
    case 3:
        result = 'літо';
        break;
    case 4:
        result = 'осінь';
        break;
    default:
        result = '?';
}

console.log(result);